src/InformationRegisters/НастройкиКонтрольПамяти/НастройкиКонтрольПамяти.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиКонтрольПамяти</name>
  <resources>
    <name>ПороговаяПамятьМБ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОповещенияОЗависшихСеансахСкрыто</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СрокХраненияДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АвтоматическиУдалятьЗаписиСеансов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Расписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Мониторинг</name>
    <comment>0 - Не мониторить, 1 - мониторить при превышении, 2 - мониторить всегда</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КонтрольнаяПроцедура</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.ВидыКонтрольныхПроцедур</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/КонтрольныеПроцедуры/КонтрольныеПроцедуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтрольныеПроцедуры</name>
  <owners>Catalog.ВидыКонтрольныхПроцедур</owners>
  <attributes>
    <name>Выполнять</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючРегламентногоЗадания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектКонтроля</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>Расписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаВыполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пауза</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДеактивацияТолькоСлужебныхЗадачПриОтключении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеИзменилось</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сохранено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещатьОСбое</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещатьОВосстановлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьИнцидент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоЗакрытиеИнцидента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительноеОповещение</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыОповещенияПриСбое</name>
    <attributes>
      <name>Оповещать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодОповещения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/НастройкиКонтрольПамяти/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс

Функция ПрочитатьНастройки(КонтрольнаяПроцедура) Экспорт
    
    МенеджерЗаписи = СоздатьМенеджерЗаписи();
    МенеджерЗаписи.КонтрольнаяПроцедура = КонтрольнаяПроцедура;
    МенеджерЗаписи.Прочитать();
    
    Настройки = Новый Структура;
    Настройки.Вставить("ПороговаяПамятьМБ", МенеджерЗаписи.ПороговаяПамятьМБ);
    Настройки.Вставить("СрокХраненияДанных", МенеджерЗаписи.СрокХраненияДанных);
    Настройки.Вставить("АвтоматическиУдалятьЗаписиСеансов", МенеджерЗаписи.АвтоматическиУдалятьЗаписиСеансов);
    Настройки.Вставить("Расписание", МенеджерЗаписи.Расписание.Получить()); 
    Настройки.Вставить("Мониторинг", МенеджерЗаписи.Мониторинг);
    
    Возврат Настройки;
    
КонецФункции

// Записать настройки
//
// Параметры:
//  КонтрольнаяПроцедура - СправочникСсылка.КонтрольныеПроцедуры - контрольная процедура, для которой записываются настройки.
//  Настройки            - Структура - структура создания с ключами:
//                                                            — ПороговаяПамять                    - Число(10,0), в мегабайтах.
//                                                            — СрокХраненияДанных                 - Число (10,0), часы.
//                                                            — АвтоматическиУдалятьЗаписиСеансов  - Булево.
//
Процедура ЗаписатьНастройки(КонтрольнаяПроцедура, Настройки) Экспорт
    
    МенеджерЗаписи = СоздатьМенеджерЗаписи();
    МенеджерЗаписи.КонтрольнаяПроцедура = КонтрольнаяПроцедура;
    
    МенеджерЗаписи.Прочитать();
    МенеджерЗаписи.КонтрольнаяПроцедура = КонтрольнаяПроцедура;
    
    Если Настройки.Свойство("ПороговаяПамятьМБ") Тогда
        МенеджерЗаписи.ПороговаяПамятьМБ = Настройки.ПороговаяПамятьМБ;
    КонецЕсли;
    
    Если Настройки.Свойство("СрокХраненияДанных") Тогда
        МенеджерЗаписи.СрокХраненияДанных = Настройки.СрокХраненияДанных;
    КонецЕсли;
    
    Если Настройки.Свойство("АвтоматическиУдалятьЗаписиСеансов") Тогда
        МенеджерЗаписи.АвтоматическиУдалятьЗаписиСеансов = Настройки.АвтоматическиУдалятьЗаписиСеансов;
    КонецЕсли;
    
    Если Настройки.Свойство("Расписание") Тогда
        МенеджерЗаписи.Расписание = Новый ХранилищеЗначения(Настройки.Расписание);
    КонецЕсли;
    
    Если Настройки.Свойство("Мониторинг") Тогда
        МенеджерЗаписи.Мониторинг = Настройки.Мониторинг;
    КонецЕсли;
    
    МенеджерЗаписи.Записать(Истина);
    
КонецПроцедуры

Функция НастройкиУдаления() Экспорт
    
    Запрос = Новый Запрос;
    
    Запрос.Текст = "
    |ВЫБРАТЬ
	|   КонтрольныеПроцедуры.ОбъектКонтроля КАК Кластер,
	|   ИнформационныеБазы.ОбъектКонтроля КАК ИнформационнаяБаза,
	|   Настройки.СрокХраненияДанных КАК СрокХраненияДанных
    |ИЗ
	|   РегистрСведений.НастройкиКонтрольПамяти КАК Настройки
    |ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|   Справочник.КонтрольныеПроцедуры КАК КонтрольныеПроцедуры
    |ПО
	|   КонтрольныеПроцедуры.Ссылка = Настройки.КонтрольнаяПроцедура
    |ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|   РегистрСведений.ПараметрыИнформационныхБаз КАК ИнформационныеБазы
    |ПО
	|   ИнформационныеБазы.Кластер = КонтрольныеПроцедуры.ОбъектКонтроля
    |ГДЕ
	|   Настройки.АвтоматическиУдалятьЗаписиСеансов
    |";
    
    Возврат Запрос.Выполнить().Выгрузить();
    
КонецФункции

#КонецОбласти

#КонецЕсли
